InformationRegisters/EDR_Interventions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>EDR_Interventions</Name>
			<Comment>V_1_00_15</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>RC_code</Name>
					<Comment>Код ощущения клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.EDR_КодыОщущенийКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Function_Code</Name>
					<Comment>Группа деталей. по которой выполнялись работы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OTS_number</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисныеКампании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСФ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробегПриУстановке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЖалобы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДиагностики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Intervention</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/EDR_Interventions/Ext/ManagerModule.bsl
Функция СоздатьИнцидент(СтруктураПараметров) Экспорт
	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров);
	МЗ.Прочитать(); //Всегда считываем
	
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров);
	Если НЕ ЗначениеЗаполнено(МЗ.GUID) тогда //нужно добавить GUID
		GUID = Новый УникальныйИдентификатор();
		МЗ.GUID = Строка(GUID);
		
		МЗ.Записать(Истина);
	Иначе
		GUID = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	Возврат Строка(GUID);
	
КонецФункции

Функция ИнцидентыСуществуют(ЗаказНаряд) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьИнцидент(СтруктураПараметров) Экспорт
	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров,"ЗаказНаряд,GUID,Intervention","RC_code,Function_Code,OTS_number,НомерСФ,ДатаСФ,ПробегПриУстановке");
	МЗ.Прочитать(); //Всегда считываем
	
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров);
	Если НЕ ЗначениеЗаполнено(МЗ.GUID) тогда //нужно добавить GUID
		GUID = Новый УникальныйИдентификатор();
		МЗ.GUID = Строка(GUID);
	КонецЕсли;
	
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьИнцидент(ИдентификаторИнцидента) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.GUID.Установить(ИдентификаторИнцидента);
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписиПоЗаказНаряду(ЗаказНаряд) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.ЗаказНаряд.Установить(ЗаказНаряд);
	
	НЗ.Прочитать();
	
	Если НЗ.Количество() > 0 тогда
		
		НЗ.Очистить();
		НЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
